AUTO_config_TK_pesok/src/InformationRegisters/ТелеграмМетоды/ТелеграмМетоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелеграмМетоды</name>
  <resources>
    <name>ОсобеннаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Параметр1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбязательныйДляЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбязательныйДляПередачи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сортировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Метод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТелеграмМетоды/ManagerModule.bsl
Процедура ЗагрузитьСлепок(ИмяСлепка) Экспорт
	
	НаборЗаписей = РегистрыСведений.ТелеграмМетоды.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	СтрокаJSON = РегистрыСведений.ТелеграмМетоды.ПолучитьМакет(ИмяСлепка).ПолучитьТекст();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Массив = ПрочитатьJSON(ЧтениеJSON);
	Для Каждого Структура Из Массив Цикл
		МенеджерЗаписи = РегистрыСведений.ТелеграмМетоды.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Структура);
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
КонецПроцедуры


Функция ВыгрузитьСлепок() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмМетоды.Метод КАК Метод,
	|	ТелеграмМетоды.Параметр КАК Параметр,
	|	ТелеграмМетоды.ОсобеннаяСборка КАК ОсобеннаяСборка,
	|	ТелеграмМетоды.Параметр1С КАК Параметр1С,
	|	ТелеграмМетоды.ОбязательныйДляЗаполнения КАК ОбязательныйДляЗаполнения,
	|	ТелеграмМетоды.ОбязательныйДляПередачи КАК ОбязательныйДляПередачи,
	|	ТелеграмМетоды.Сортировка КАК Сортировка,
	|	ТелеграмМетоды.Тип КАК Тип,
	|	ТелеграмМетоды.Описание КАК Описание
	|ИЗ
	|	РегистрСведений.ТелеграмМетоды КАК ТелеграмМетоды
	|
	|УПОРЯДОЧИТЬ ПО
	|	Метод,
	|	Сортировка";
	
	Массив = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура(
			"Метод,Параметр,ОсобеннаяСборка,Параметр1С,
			|ОбязательныйДляЗаполнения,ОбязательныйДляПередачи,Сортировка,
			|Тип,Описание");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);	
		Массив.Добавить(Структура);
	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ТелеграмСервер.ПараметрыЗаписиJSON());
	ЗаписатьJSON(ЗаписьJSON, Массив);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции
